#### PointOnPlane Members

---

|  |
| --- |
| PointOnPlane Class   Methods   Properties   See Also |

The  PointOnPlane  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetPlaneReference | The geometric plane reference. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | IsValidPlaneReference | Check whether a geometry reference corresponds to a referenceable plane. |
| Public method Static member | NewPointOnPlane | Construct a PointOnPlane given a reference and a location in space. |
| Public method | SetPlaneReference | Change the geometric plane reference. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Offset | Signed offset from the plane. |
| Public property | Position | The coordinates of the point (or its projection) on the plane. |
| Public property | XVec | The X-coordinate vector of the point, in the plane's coordinate system. |

# See Also

PointOnPlane Class

Autodesk.Revit.DB Namespace